Dejavu-Jamaisvu/STM32_AI_System_Semiconductor_SW/stm_project/STM32f411_cli/MyApp/hw/driver/my_gpio.c
#include "my_gpio.h"
#include "stm32f411xe.h"
#include "stm32f4xx_hal_gpio.h"
#include <stdint.h>

static GPIO_TypeDef* getPortPtr(uint8_t port_idx)
{
    switch (port_idx){
        case 0: return GPIOA;
        case 1: return GPIOB;
        case 2: return GPIOC;
        case 3: return GPIOD;
        case 4: return GPIOE;
        // case 5: return GPIOF;
        // case 6: return GPIOG;
        case 7: return GPIOH;
        default: return NULL;
    }

}

bool gpioExtWrite(uint8_t port_idx, uint8_t pin_num, uint8_t state){
    if(pin_num>15) return false;

    GPIO_TypeDef* pPort = getPortPtr(port_idx);
    if(pPort==NULL) return false;

    uint16_t pin_mask=(1<<pin_num);
    HAL_GPIO_WritePin(pPort, pin_mask, (state >0)?GPIO_PIN_SET:GPIO_PIN_RESET);
    return true;
}
int8_t gpioExtRead(uint8_t port_idx, uint8_t pin_num) {
    if(pin_num>15) return -1; //1:high, 0:low, -1:error

    GPIO_TypeDef* pPort = getPortPtr(port_idx);
    if(pPort == NULL) return -1;

    uint16_t pin_mask=(1 << pin_num);
    return HAL_GPIO_ReadPin(pPort, pin_mask) == GPIO_PIN_SET?1:0;
}